EnableRevealHiddenMode Method
 Enables Reveal Hidden elements mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void EnableRevealHiddenMode()
Visual Basic
Public Sub EnableRevealHiddenMode
Visual C++
public:
void EnableRevealHiddenMode()
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException |  View cannot use temporary visibility modes.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →